Tekla Open API Reference for Tekla Structures 2025
WpfOkApplyModifyGetOnOffCancel.ModifyClicked Event
 The ModifyClicked event is raised when the Modify button is clicked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler ModifyClicked
Public Event ModifyClicked As EventHandler
Value
Type: System.EventHandler
See Also
Reference
WpfOkApplyModifyGetOnOffCancel Class
Tekla.Structures.Dialog.UIControls Namespace